Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ལག་ན་རྡོ་རྗེ་དང་འདྲ་བར་གཟུགས་དང་། མཐུ་དང་། བརྩོན་འགྲུས་ཕ་རོལ་གྱི་ཟིལ་གྱིས་མི་ནོན་པར་འགྱུར་རོ། །ལག་ན་རྡོ་རྗེ་དང་འདྲ་བར་རིག་སྔགས་འཆང་གི་དབང་པོར་འགྱུར་རོ།
en: He will possess beauty, strength, diligence, and valor similar to that of Vajrapāṇi.

source: །ལྷའི་ལོ་ཁྲི་ཉིས་སྟོང་དུ་འཚོ་བར་འགྱུར་རོ།
en: He will live twelve thousand celestial years. “

source: །ལས་ཐམས་ཅད་བགྱིད་པ་རྡོ་རྗེའི་ཞགས་པ་དགྲ་ཐམས་ཅད་འཇོམས་པར་བགྱིད་པའི་ཞགས་པ་སྟེང་ངམ་འོག་གར་འཕངས་པར་ཡིད་ལ་བསམས་པ་བཞིན་ཐམས་ཅད་བཅིངས་ནས་དགུག་པར་བགྱིད་དོ།
en: The vajra noose can accomplish all tasks and destroy all enemies. Wherever the vidyā holder casts this noose, whether up or down, he will bind any being he has in mind and bring it into his presence.

source: །ཕྱོགས་བཅུར་འཕང་སྟེ་ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་ནས་སྐྱེས་པ་དང་། བུད་མེད་དམ། གཞན་གང་ཅི་ཡང་རུང་བ་ཐམས་ཅད་ཞགས་པས་བཅིངས་ནས། མྱུར་དུ་དགུག་པར་བགྱིད་དེ།
en: If he casts the noose into the cardinal or intermediate directions while reciting the Krodharāja, he will quickly bind and draw any woman or man, or any other being, whoever it is, with the noose.

source: སོམ་ཉི་མི་བགྱིའོ། །གལ་ཏེ་ལྷ་འམ། ཀླུ་འམ། གནོད་སྦྱིན་ནམ། སྲིན་པོ་འམ། དྲི་ཟ་འམ།
en: There is no doubt about this.

source: ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་ངམ། མི་འམ་ཅི་འམ། འབྱུང་པོ་འམ། ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་ཞགས་པས་བཅིངས་ནས་མྱུར་དུ་དགུག་པར་བགྱི་སྟེ་སོམ་ཉི་མི་བགྱིའོ།
en: Whether it is a deva, a nāga, a yakṣa, a rākṣasa, a gandharva, an asura, a garuḍa, a kinnara, a bhūta, or a mahoraga, he can swiftly summon any of them, bound by the noose.

source: །ཞགས་པ་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱི་སྟེ།
en: There is no doubt. “

source: མར་གྱི་ངོའི་ཚེས་བཅུ་བཞིའི་མཚན་མོ་ནམ་ཕྱེད་ན་ཞགས་པ་ཕྱོགས་བཞིར་འཕང་བར་བགྱིའོ། །འཕངས་པ་ཙམ་གྱི་མོད་ལ་བགེགས་དང་། ལོག་འདྲེན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་།
en: If the vidyā holder incants the noose with the Krodharāja twenty-one times on the fourteenth day of the dark fortnight, during a dark night, and casts it in the four cardinal directions, all the vighnas, vināyakas, wicked yakṣas, and rākṣasas will be bound and brought into the presence of the vidyā holder as soon as the noose is cast.

source: གདུག་པ་ཐམས་ཅད་ཞགས་པས་བཅིངས་ནས། རིག་སྔགས་འཆང་གི་མདུན་ན་མཆིས་ཤིང་ཅི་སྲིད་འཚོའི་བར་དུ་དབང་དུ་གྱུར་ནས་མཆིས་ཏེ། བྲན་བཞིན་དུ་ལས་ཐམས་ཅད་བགྱིད་པར་འགྱུར།
en: They will perform all his tasks and remain in his thrall as his servants for the rest of their lives.

source: བལྟས་པ་ཙམ་གྱིས་གདོན་ཐམས་ཅད་ལས་ཐར་བར་འགྱུར་རོ།
en: All grahas will leave him alone if they merely see the noose. “

source: །ཞགས་པ་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ། ལག་པས་ཞགས་པ་བླངས་ཏེ་དུར་ཁྲོད་དུ་ཞུགས་ན་མི་སྣང་བར་འགྱུར་ཞིང་གནས་ཐམས་ཅད་ཀྱི་སྒོ་དབྱེ་བར་འགྱུར་རོ།
en: If the vidyā holder incants the noose with the Krodharāja one hundred and eight times and then enters a charnel ground while holding it in his hand, he will be invisible.

source: །ཕུག་གི་སྒོར་མཆིས་ནས་རྡོ་རྗེའི་ཞགས་པས་བརྡབས་ན། ཕུག་ཐམས་ཅད་ཀྱི་སྒོ་དབྱེ་བར་འགྱུར་ཞིང་འཁྲུལ་འཁོར་དང་གཏན་པ་ཐམས་ཅད་དུམ་བུར་འཆག་པར་འགྱུར་རོ། །ལམ་ངན་པ་དང་། མི་ངན་པ་དང་།
en: The gates to all palaces will be open for him, and if he approaches any secret passage and strikes its opening with the vajra noose, it will open.

source: མི་མ་ཡིན་པ་དང་།
en: All the locks and bolts will split.

source: འབབ་ཆུ་ངན་པ་དང་། སྦྲུལ་དང་། དབུགས་གདུག་པ་དང་། སྲོག་ཆགས་གོན་ས་དང་། གདུག་པ་དང་བཅས་པའི་སྲོག་ཆགས་སུ་གཏོགས་པ་ཐམས་ཅད་མི་གདའ་བར་འགྱུར་རོ།
en: All the dangers of the road, bad people, nonhuman beings, and river crossings will vanish, and venomous aśīviṣa and gonāsa snakes will become lifeless.

source: །མི་དྲང་བོ་དང་ལམ་དྲང་བོར་ཅི་ལྟར་རང་གི་གནས་སམ།
en: Walking straight on a straight path, the vidyā holder should enter the passage as if entering his own house.

source: གཙུག་ལག་ཁང་ངམ། ཁང་པ་བཞིན་དུ་ཞུགས་ནས་དགོས་པ་ཐམས་ཅད་བསྒྲུབས་ཏེ། སླར་ཡང་གནས་ནས་ཕྱིར་ལྡོག་པར་འགྱུར་རོ།
en: Once he has accomplished all his intended tasks there, he can leave the dwelling again. “

source: །རྡོ་རྗེའི་ཞགས་པ་ལས་ཐམས་ཅད་བགྱིད་པ་སྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This was the practice procedure of the vajra noose that accomplishes all activities. “

source: དེ་ནས་རིག་སྔགས་འཆང་ནོར་བུའི་ཞགས་པ་བསྒྲུབ་བར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་ནོར་བུ་འཚལ་བར་བགྱི་སྟེ།
en: If the vidyā holder wants to accomplish the practice of the jewel noose, he should procure a suitable jewel.

source: རྡོ་རྗེའམ། བཻ་ཌཱུརྱ་འམ། ཤེལ་རང་འབྱུང་ངམ། མ་རྒད་དམ། ཨིན་དྲ་ནཱི་ལ་ལ་སོར་མོའི་ཚིགས་པས་ལྷག་ཙམ་ཤིན་ཏུ་ཕྱིས་ལ།
en: It could be a diamond, beryl, natural crystal, emerald, or sapphire the size of a finger joint.

source: ཤིན་ཏུ་ཡོངས་སུ་དག་པར་བགྱིས་ལ། གསེར་གྱི་མེ་ཏོག་གི་ཚུལ་དུ་བགྱིས་པ། མུ་ཏིག་གིས་དཀྲིས་པ། གེ་སར་ཁ་ཕྱེ་བ་ཙམ་པ་ཀའི་མེ་ཏོག་ཅི་ལྟ་བ་བཞིན་བགྱིས་ལ།
en: Having cleaned it thoroughly with utmost care, the vidyā holder should set it in a golden setting shaped like a flower and surround it with pearls.

source: རས་བཟང་པོའི་སྐུད་པ་ཚོན་རྩི་མཛེས་པས་ཁ་བསྒྱུར་བ། ཤིན་ཏུ་ཚད་ལ་བབ་པར་བཀལ་བ་ཁྲུ་ཉི་ཤུ་རྩ་གཅིག་པ།
en: He should prepare a thread, cut to the measure of exactly twenty-one cubits, from divine cotton the beautiful orange color of champak blossoms bristling with filaments.

source: སོར་མོ་གུང་མོའི་ཚད་ཙམ་གྱི་ནོར་བུས་བརྒྱན་ལ། ཐོར་ཏོ་ཅིག་ཤོས་སུ་ནི་ནོར་བུ་འམ་གསེར་ལས་བགྱིས་པའི་ལྕགས་ཀྱུ་གདགས་པར་བགྱིའོ།
en: At one end, the vidyā holder should attach the jewel, which should be the size of the middle finger, and at the other, a hook made of precious stone or gold. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོ་བར་བགྱིའོ། །ལེགས་པར་བཀྲུས་ནས་བའི་རྣམ་ལྔས་ཉེ་རེག་བགྱིའོ།
en: The vidyā holder, ritually pure and wearing clean clothes, should then perform ablutions and sprinkle himself with the five products of the cow.

source: །དེའི་འོག་ཏུ་རི་མོའི་གཟུགས་ཀྱི་མདུན་དུ་སྤོས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ཚད་དང་ལྡན་པ་བགྱིས་ལ་གྲྭ་བཞིར་བུམ་པ་གང་བ་གཞག་པར་བགྱིད་ཅིང་། སྤོས་ཕོར་གྱི་སྣོད་བཤམས་ནས། ཨ་ག་རུའི་བདུག་པ་དང་། ཙན་དན་དང་།
en: He should prepare a maṇḍala in front of a painting with four sides of equal length, smear it with every fragrance, and put out full jars.

source: དུ་རུ་སྐའི་བདུག་པ་དབུལ་བར་བགྱིའོ།
en: He should arrange incense bowls around it, offering incense of agarwood, sandalwood, and olibanum.

source: །དཀྱིལ་འཁོར་གྱི་དབུས་སུ་ཆོས་ཀྱི་སྟན་བཟང་པོ་ཚད་དང་ལྡན་པ་བཤམས་ལ།
en: In the center of the maṇḍala, the vidyā holder should arrange a divine seat the size of a Dharma seat.

source: བ་དན་སྣ་ཚོགས་ཀྱིས་དཀྱིལ་འཁོར་བསྐོར་བར་བགྱིའོ། །མེ་ཏོག་སིལ་མ་དང་། དྲི་དང་རོལ་མོའི་ཆ་བྱད་དག་དགོད་པར་བགྱིའོ།
en: The maṇḍala should be surrounded by various banners, well adorned, strewn with flowers, and perfumed, and it should have musical instruments placed around it. “

source: །རིག་སྔགས་འཆང་གིས་ཟས་དཀར་གསུམ་འཚལ་བར་བགྱིའོ། །བཏུང་བ་ངན་པ་དང་། ཁ་ཟས་ངན་པ་དང་། གནས་ངན་པ་དང་། ལྷག་མ་དང་། སྦགས་རྣམས་རྣམ་པར་སྤང་བར་བགྱིའོ།
en: The vidyā holder should live on the three ‘white’ foods and avoid bad food and drink, food and drink that has been inappropriately stored, and leftovers.

source: །དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ཉི་ཁྲི་ཆིག་སྟོང་བཟླས་ནས།
en: He should then recite the heart mantra of Amogharāja twenty-one thousand times.

source: ལག་པ་གཡས་པས་ཆོས་ཀྱི་སྟན་གྱི་སྟེང་དུ་བཞག་པའི་ཞགས་པ་ལ་མནན་ནོ།
en: The noose should be placed on the Dharma seat and pressed down with the right hand.

source: །ལན་ཉི་ཁྲི་ཆིག་སྟོང་ཚང་བ་དང་། དེ་ནས་རིག་སྔགས་འཆང་གིས་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་སྟོང་རྩ་བརྒྱད་ཚང་བར་བཟླས་ཏེ།
en: When the vidyā holder has completed twenty-one thousand recitations, he should recite the mantra of Krodharāja a full one thousand and eight times.

source: ཡུངས་ཀར་རེ་རེ་ནས་དབང་བསྐུར་བར་བགྱིའོ།
en: With each repetition of the Krodharāja, he should cast a single mustard seed onto the noose.

source: །ལན་སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་། རིག་སྔགས་འཆང་གིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ལ་མཆོད་པར་རྒྱ་ཆེར་བགྱིའོ།
en: When the number one thousand and eight has been reached, he should offer a large pūjā in front of the cotton painting of Noble Avalokiteśvara.

source: །བཅོམ་ལྡན་འདས་འོད་དཔག་མེད་དང་། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཡང་མཆོད་པ་རྒྱ་ཆེར་བགྱིའོ།
en: He should likewise offer a large pūjā to the blessed Amitābha and the Tathāgata Śākyamuni. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཚེས་བཅྭ་ལྔའི་ཉ་ལ་ཉིན་ཞག་གཅིག་སྨྱུང་བ་བགྱིས་ནས་མཆོད་པ་རྒྱ་ཆེར་བགྱིས་ཏེ།
en: During the full moon on the fifteenth lunar day, after fasting for one day and one night, he should worship the noose with elaborate offerings, fully completing each stage of the ritual exactly as required.

source: མཆོད་པའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ལ་རེ་རེ་ནས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་རེ་རེ་ནས་བཟླས་བརྗོད་བགྱིས་ནས་དབུལ་བ་བགྱིའོ།
en: He should incant the offerings with the heart mantra of Amoghapāśa twenty-one times and offer them.

source: །དེ་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་མཆིས་ནས། ཉིན་མཚན་ཀུན་ཏུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ཏེ། ཡུངས་ཀར་རེ་རེ་ནས་བརྡེག་པར་བགྱིའོ།
en: Then, sitting in a cross-legged posture all day and all night, he should recite the same mantra one thousand and eight times, casting, with each recitation, a single mustard seed onto the noose.

source: །ལན་སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་ས་ཆེར་གཡོ་བར་འགྱུར་རོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ལས་ཀྱང་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་དག་འབྱུང་བར་འགྱུར་རོ།
en: When the number one thousand and eight has been reached, there will be a great earthquake, and Noble Avalokiteśvara in the cotton painting will emit multicolored light.

source: །ནོར་བུའི་ཞགས་པ་དེ་ཡང་འབར་བར་འགྱུར། རིག་སྔགས་འཆང་གི་མགོ་བོ་ཡང་འབར་བར་འགྱུར་རོ།
en: This light will make the jewel noose blaze with light, and the body of the vidyā holder will blaze too.

source: །འབར་བ་ཙམ་གྱི་མོད་ལ་རིག་སྔགས་འཆང་གི་ལག་པ་གཡས་པས་ནོར་བུའི་ཞགས་པ་བླངས་པ་ན། སྒྲ་ཆེན་པོ་ཡང་འབྱུང་བར་འགྱུར་རོ།
en: The vidyā holder should grasp the noose with the right hand as soon as it blazes, whereupon a loud sound will be heard. “

source: །དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལྷའི་བདག་ཉིད་ཀྱི་རང་བཞིན་གྱིས་རིག་སྔགས་འཆང་གི་མདུན་ན་མཆིས་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དང་། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དང་།
en: At that time, Noble Avalokiteśvara and the tathāgatas Amitābha and Śākyamuni will appear before the vidyā holder in their true divine forms.

source: དེ་བཞིན་གཤེགས་པ་འཕགས་པ་སྤྱན་རས་གཟིགས་འོད་ཀྱི་རྒྱལ་པོའི་སྐུ་གསེར་གྱི་ཁ་དོག་གིས། ནམ་མཁའ་ལ་རྫུ་འཕྲུལ་གྱིས་བཞུགས་ནས།
en: They and the sovereign lord Avalokita will, through their magical power, remain suspended in space in their golden tathāgata-bodies and will applaud the vidyā holder.

source: རིག་སྔགས་འཆང་ལ་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་བར་འགྱུར། ཕྱག་དཔུང་པ་གསེར་གྱི་ཁ་དོག་འདྲ་བ་བརྐྱང་བའི་ཕྱག་གིས། རིག་སྔགས་འཆང་གི་མགོ་བོར་བཞག་ནས། རིག་སྔགས་འཆང་ལ་དབུགས་འབྱིན་པར་མཛད་དེ།
en: Extending their golden arm, each of them will place his hand upon the vidyā holder’s head and comfort him, saying, ‘Good!

source: །ཁྱོད་ཀྱིས་ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོ་དོན་ཡོད་པའི་ཞགས་པ་རྣམ་པར་དག་པ་གྲུབ་བོ།
en: You have accomplished the pure practice of the great wish-fulfilling, unfailing jewel-noose.

source: །ཁྱོད་ཀྱིས་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་ལས་བསྒྲུབ་པའི་ཆོ་ག་བླ་ན་མེད་པ་གྲུབ་སྟེ།
en: You have accomplished the supreme procedure of this ritual practice that has both worldly and supramundane applications.

source: རིག་སྔགས་འཆང་གིས་འདོད་དགུར་བསྒྱུར་བ་ཐམས་ཅད་དེ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་དོན་ཡོད་གྲུབ་པ་ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོའི་ཞགས་པ་ཐོགས་ནས། རིག་སྔགས་འཆང་གིས་འབད་མི་དགོས་པར་ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོ་དོན་ཡོད་པའི་ཞགས་པ་གྲུབ་པའི་རང་བཞིན་འདིས།
en: Noble Avalokiteśvara will fulfill all the wishes of the vidyā holder who holds the great wish-fulfilling jewel-noose that brings amogha accomplishments.

source: འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་དགོས་པ་རྣམ་པ་སྣ་ཚོགས་སྒྲུབ་པར་བྱེད་པ་ལ་ལྟོས་ཤིག །
en: You should strive, O vidyā holder, with all your being, to demonstrate the successful performance of the required tasks that are based on worldly and supramundane procedures.

source: ཡིད་ལ་ཅི་ལྟར་བསམས་པ་བཞིན་རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་སྣ་ཚོགས་ལ་ལྟོས་ཤིག །
en: You should display, through your magical power, various magical creations according to your wish.

source: རིག་སྔགས་འཆང་ཁྱོད་ཤི་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སོང་ཞིག །འོན་ཏེ་བདེ་བ་ཅན་བལྟ་བར་འཚལ་ལམ། ཅི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་འོས་པའི་ལྷ་རྫས་ཀྱི་མཆོད་པར་འཚལ་ལམ། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་སྤྲིན་གྱིས་མཆོད་པར་འཚལ་ལམ། ལྷའི་མེ་ཏོག་དང་། ལྷའི་དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: When you die, O vidyā holder, you will proceed to the realm of Sukhāvatī.’ “

source: དྲིལ་བུ་དང་། བ་དན་དང་། ལྷབ་ལྷུབ་དང་། རྒྱན་དང་གོས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་བགྱི་བ་འཚལ་ན། རིག་སྔགས་འཆང་དེས་སྤྱི་བོའི་གཙུག་ཏུ་དྲིའི་དཀྱིལ་འཁོར་བགྱིས་ལ་མེ་ཏོག་དང་།
en: If the vidyā holder wants to see the realm of Sukhāvatī and worship the tathāgatas, the worthy ones, with heaps of divine offerings suitable for them—offerings such as divine flowers, fragrances, garlands, scented oils, scented powders, clothes, parasols, banners, flags, ornaments, adornments, and fabrics—he should prepare a fragrant maṇḍala at a prominent spot and offer flowers and incense.

source: བདུག་པ་ཡང་དབུལ་ལོ། །ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོ་དོན་ཡོད་པའི་ཞགས་པའི་མཆོག་འདི། ལག་པ་གཡོན་པས་མནན་ལ། ལག་པ་གཡས་པས་དོན་ཡོད་པ་ཡིད་བཞིན་གྱི་ནོར་བུའི་མཆོག་བཟུང་ནས།
en: With his left hand he should press down on the great unfailing noose attached to the wish-fulfilling jewel and grasp the wish-fulfilling amogha jewel with his right hand.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། འདི་ལྟ་བུ་ཡིད་ལ་བགྱིད་པ་ཆེན་པོ་ཅི་ལྟ་བུའི་བསམ་པ་ཡིད་ལ་བགྱིད་པ་དེ་ལྟ་བུ་ཡང་བསམས་ནས།
en: He should place his right knee on the ground and, in the spirit of great sincerity, bring to mind whatever heartfelt wishes he may have.

source: དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ལན་བདུན་བཟླས་ཏེ་ཕྱག་བགྱིའོ། །ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་རྒྱ་ཆེན་དོན་ཡོད་པ་འདི་བཟླས་ནས།
en: He should recite the heart mantra of Amogharāja seven times while bowing to the great wish-fulfilling jewel.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྙིང་པོ་འདི་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ། །བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་གདུངས་པའི་སྙིང་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་བརྩེ་བར་བགྱིས་ནས་གསང་སྔགས་བཟླས་བརྗོད་བགྱིའོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་ལྔ་པ།
en: Then, as his heart overflows with great loving kindness and compassion, he should recite the following heart mantra of Noble Avalokiteśvara, which promotes great amogha activity, one hundred and eight times, wholly motivated by a sense of care for all beings.

source: དུས་གསུམ་དུ་གཤེགས་ཤིང་བཞུགས་པའི་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་མཐའ་ཡས་པ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: The mantra is: “Homage to all the buddhas and bodhisattvas established throughout the three times, comparable to the expanse of the ocean!

source: །ཡང་དག་པར་སོང་བ་དང་། ཡང་དག་པར་ཞུགས་པ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to those who follow the right path and have the right understanding!

source: །བློ་གྲོས་ཆེན་པོ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Śāradvatīputra, the great lord of charity!

source: །གནས་ཀྱི་མཆོག་དགའ་ལྡན་ན་གནས་པ་འཕགས་པ་བྱམས་པ་ལ་སོགས་པའི་ཚོགས་དང་བཅས་པའི་མཆོག་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the great inhabitants of the supreme abode of Tuṣita, headed by Noble Maitreya, together with the eminent hosts!

source: །བདེ་བ་ཅན་གྱི་དཀྱིལ་འཁོར་ན་བཞུགས་པ་དེ་བཞིན་གཤེགས་པ་འཕགས་པ་འོད་དཔག་མེད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the noble Tathāgata Amitābha, who dwells in the realm of Sukhāvatī!

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཕྱག་འཚལ་ལོ། །ཚངས་པ་དང་།
en: Homage to Noble Avalokiteśvara, the great and most compassionate bodhisattva being!

source: ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། དབང་ཕྱུག་ལ་སོགས་པའི་ལྷའི་བུ་གཟུགས་སྣ་ཚོགས་མངའ་བ་སྤྱན་རས་གཟིགས་ལ་ཕྱག་འཚལ་ལོ། །ཏདྱ་ཐཱ། ཨོཾ་མ་ཧཱ་པདྨ་ཙིནྟ་མ་ཎི་མ་ཎི།
en: Homage to Avalokita who manifests all forms, including those of the divine sons headed by Brahmā, Viṣṇu, Maheśvara, and Īśvara!’ “

source: ཨ་མོ་གྷ་མ་ཎི་སུ་མ་ཎི།
en: The part of the mantra to be repeated is: [165] “Oṁ, the great wish-fulfilling jewel in the lotus!

source: མ་ཧཱ་མ་ཎི།
en: Jewel, jewel, the amogha jewel, the good jewel, the great jewel!

source: སརྦ་ཏ་ཐཱ་ག་ཏ།
en: The great amogha jewel that adorns all the tathāgatas!

source: ཨ་ལཾ་ཀཱ་ར། མ་ཧཱ་ཨ་མོ་གྷ་མ་ཎི། ཙ་ར་ཙ་ར་སཉྩ་ར།
en: Act, act, be active!

source: ནི་ཤ་ཙ་ཙ་རེ་ཤྭ་ར་མ་ཧཱ།
en: O lord of spirits that roam at night!

source: པདྨ་བྷུ་ཛ་བ་ར་ད། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །
en: The great lotus-armed one!

source: མ་ཧཱ་བི་ཤྭ་རཱུ་པ་དྷ་ར།
en: The most compassionate boon giver!

source: པྲ་བ་ར་མ་ཧཱ་བོ་དྷི་སཏྭ་པདྨ་དྷ་ར་པདྨཱ་ས་ན་པདྨ་མ་ཀུ་ཊ།
en: The great and most excellent bodhisattva who can assume any form!

source: མཱ་ལཱ་དྷ་ར། པདྨ་གཽ་ར། པདྨཱ་ལཾ་ཀྲྀ་ཏ་ཏ་ནུ།
en: You hold a lotus, sit on a lotus seat, wear a lotus diadem and garland, and are adorned with many lotuses.

source: ས་ཏ་སྲ་བྷུ་ཛས་ཧ་སྲ་ནེ་ཏྲ་ནཱ་ནཱདྦྷུ་ཏ།
en: You have a thousand arms, a thousand eyes, and various magical implements, and your thousand arms are adorned with mudrā gestures.

source: བྲ་བ་ར་ཎ།
en: Be victorious, be!

source: མུ་དྲཱ་བི་བྷཱུ་ཥི་ཏཱ་ས་ཧ་སྭ་བྷུ་ཛ།
en: Your body is adorned with hundreds of thousands of light rays.

source: ཛ་ཡ་ཛ་ཡ། ཤ་ཏ་ས་ཧ་སྲ་ར་སྨི་པྲ་ཏི་མཎྜི་ཏ་ཤ་རཱི་ར།
en: O wearer of fine adornments, wear them, wear!

source: བྷ་ར་བྷ་ར།
en: Your body is adorned with jewels, gold, diamonds, beryls, emeralds, sapphires, and corals, ciri ciri!

source: བི་ཙི་ཏྲ། ཨཱ་བྷ་ར་ཎ་དྷ་ར།
en: You are a great boon-granting bodhisattva of illustrious conduct.

source: མ་ཎི་ཀ་ན་ཀ། བཛྲ་བཻ་ཌཱུརྱ།
en: You assume the forms of Brahmā, Viṣṇu, and Maheśvara.

source: མརྐྐ་ཏ། ཨིན་དྲ་ནཱི་ལ་པདྨ་རཱ་ག་བྷྲཱུ་ཥི་ཏ་ཤ་རཱི་ར།
en: You take on the form of the lotus lord, the lokeśvara, and the eternal lord.

source: ཙི་རི་ཙི་རི། བི་ཙི་ཏྲ། ར་ཙ་ཎ།
en: You wear the garb of Yama, Varuṇa, Kubera, the sages, and the general Kumāra, dhara dhara,dhiri dhiri, dhūra dhūra!

source: མ་ཧཱ་བོ་དྷི་སཏྭ་བ་ར་དཱ་བྲཧྨ།
en: You, consecrated by all the tathāgatas, assume the form of the four great elements.

source: བིཥྞུ་མ་ཧེ་ཤྭ་ར་རཱུ་པ་དྷ་ར།
en: Remember your samaya, O lord!

source: པདྨེ་ཤྭ་ར།
en: Make the moon full!

source: ལོ་ཀེ་ཤྭ་ར།
en: Ferry beings to the other shore!

source: ཡ་མཱནྟེ་ཤྭ་ར།
en: Train the beings!

source: བ་རུ་ཎ།
en: Threaten the wicked ones!

source: ཀུ་བེ་ར།
en: Bring down the vighnas!

source: རྀ་ཥི་ག་ཎ།
en: Kill those who are stained by the three faults!

source: ཀུ་མཱ་ར། སེནཱ་བ་ཏི་བེ་ཤ་དྷ་ར།
en: Assail evil, assail, assail!

source: དྷ་ར་དྷ་ར། དྷི་རི་དྷི་རི། དྷུ་རུ་དྷུ་རུ།
en: Hūṁ hūṁ hūṁ, phaṭ phaṭ phaṭ!

source: མ་ཧཱ་བྷུ་ཏ་བི་ཤ་དྷ་ར། སརྦ་ཏ་ཐཱ་ག་ཏཱ་བྷི་ཥེ་ཀ་ཏ་ས་མ་ཡ་མ་ནུ་སྨར་བྷ་ག་བཱན། པུ་ར་ཡ་མེ་ཨཱ་ཏཱ་ཤཱནྟ་ཏཱ་རཱ་ཡ་པཱུ་ར་ཤཱ་ཡཱ་ཡ་ས་ཏྭ་ན།
en: Succeed, succeed, O holder of the unfailing noose with its great wish-fulfilling jewel!

source: ཏརྫྫ་ཡ་དུཤྚཱཾ། བཱ་ཏ་ཡ་པིགྷྣཱཾ།
en: Bring accomplishment!

source: མཱ་ར་ཡ་ཏྲི་དོ་ཥ་མཱ་ལཾ།
en: Grant me the great accomplishment of the goddess of the threefold universe!

source: ས་ར་ས་ར་པཱ་པཾ། ཧཱུྃ་ཧཱུྃ་ཧཱུྃ།
en: O compassionate one, be awake, be!

source: ཕཊ་ཕཊ་ཕཊ། སིད་དྷྱ་སིད་དྷྱ། མ་ཧཱ་ཅིནྡཱ་མ་ཎི།
en: Awaken, awaken others!

source: ཨ་མོ་གྷ་པཱ་ཤ་དྷ་ར། སཱ་དྷ་ཡ་སཱ་དྷ་ཡ།
en: Awaken them fully!

source: བི་པུ་ལ་སིད་དྷི།
en: You wear the garb of the great Paśupati.

source: མ་མ་ཏྲི་བྷུ་བ་ན་དི་བྱ་པྲ་ཡཙྪ།
en: Please display your infinite power of magical transformation!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །
en: Turū turū, you travel across the sky.

source: བོ་དྷ་ཡ་བོ་དྷ་ཡ།
en: You hold a large treasure trove of merit.

source: སཾ་བྷོ་དྷ་ཡ། སཾ་བྷོ་དྷ་ཡ། མ་ཧཱ་པ་ཤུ་པ་ཏི་གེ་ཥ་དྷ་ར།
en: O great Amoghasiddhi, hūṁ hūṁ!

source: ཨ་ནནྟ་བི་ཀུརྦྦ་ཎ། རྀདྡྷི་སན་དརྵ་ཡ།
en: Give me an initiation!

source: ཏུ་རུ་ཏུ་རུ། ཏ་ར་ཏ་ར། ག་ག་ནེ་བི་པུ་ལ་བི་མཱ་ན། སཾ་ད་ནི་ཀ །ན་མོ་སྟུ་ཏེ་བི་པུ་ལ་པུ་ཎྱ།
en: You confer great fame of the goddess of the threefold universe, svāhā!

source: ཀོ་ཤཱ་དྷ་ར། མ་ཧཱ་ཨ་མོ་སིད་དྷེ་ཧཱུྃ་ཧཱུྃ།
en: Bhuva svāhā!

source: ཨ་བྷི་ཥིཉྩ་ཏུ་མཱྃ། བི་པུལ་ཀཱིརྟི་ཀ་ཏེ་སྭཱ་ཧཱ།
en: Bhūr bhuva svāhā!

source: བྷུ་བ་སྭཱ་ཧཱ། བྷུར་བྷུ་བ་སྭཱ་ཧཱ།
en: Svāhā to Amoghavipula!Svāhā to the one who grants the accomplishment of the wish-fulfilling jewel!

source: ཨ་མོ་གྷ་བི་པུ་ལེ་སྭཱ་ཧཱ།
en: Svāhā to him who grants all the supreme accomplishments!

source: མ་ཧཱ་ཙིནྟཱ་མ་ཎི་སིདྡྷེ་སྭཱ་ཧཱ།
en: Oṁ, majestic lord, lord of the world, great lord, you are a great wish-fulfilling jewel!

source: མ་ཧཱ་ཙིནྟ་མ་ཎི་སིདྡྷི་བར་དེ་སྭཱ་ཧཱ།
en: O great Amoghasiddhi!

source: སརྦ་སིད་དྷི་བར་དེ་སྭཱ་ཧཱ། ཨོཾ་བི་པུ་ལེ་ཤྭ་ར།
en: Hūṁ phaṭ, svāhā! “

source: ལོ་ཀེ་ཤྭ་ར། མ་ཧཱ་ཙིནྟཱ་མ་ཎི། མ་ཧཱ་ཨ་མོ་གྷ་སིད་དྷེ་ཧཱུཾ་ཕཊ་སྭཱ་ཧཱ། དོན་ཡོད་ནོར་བུའི་ཞགས་པ་ཆེན་པོ་འདི་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་མ་ཐག་ཏུ་རིག་སྔགས་འཆང་གི་ལུས་ཐམས་ཅད་འབར་བར་འགྱུར་རོ།
en: Immediately after incanting the great unfailing jewel-noose with this mantra one hundred and eight times, the vidyā holder’s entire body will blaze will light.

source: །དོན་ཡོད་པའི་ཞགས་པ་ལགས་པས་མནན་ན་ནམ་མཁའི་ངོས་ལ་རྫུ་འཕྲུལ་གྱིས་མཆི་བར་འགྱུར་རོ།
en: If he then presses down on the unfailing noose with his hand, he will magically fly into the sky.

source: །སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་འདྲ་བའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ཆེན་པོ་སྟོན་པར་འགྱུར་རོ།
en: Through his great magical power, he will display illusion-like miraculous creations.

source: །འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་མཐོང་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱང་ཚོགས་དང་བཅས། འཁོར་དང་བཅས། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་དཀྱིལ་འཁོར་དང་། གཞལ་མེད་ཁང་མཆོག་དང་བཅས་པ་རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་འཕྲུལ་པ་མཐོང་བར་འགྱུར་རོ།
en: He will be able to see the realm of Sukhāvatī, where he will behold the Tathāgata Amitābha with his retinue and the great gathering of bodhisattvas in their palatial estates, surrounded by magical creations.

source: །བདེ་བ་ཅན་གྱི་གནས་མཐའ་དག་ཏུ་མཆོད་པའི་ཆར་སྤྲིན་གྱི་ཚོགས་ཆེན་པོ་འབྱུང་བར་འགྱུར་ཞིང་། དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཀྱི་མཐུས་མཆོད་པའི་སྤྲིན་ཆེན་པོར་གནས་པར་འགྱུར་རོ།
en: Great clouds of offerings will appear, raining down. “Through the power of the Tathāgata Amitāyus, great clouds of offerings will continuously rain down offerings upon all the inhabitants of Sukhāvatī.

source: །བདེ་བ་ཅན་ན་གནས་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་དེས། རིག་སྔགས་འཆང་ལ་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་དེས་ཀྱང་སྒྲ་དེ་དག་ཐམས་ཅད་ཐོས་པར་འགྱུར་ཞིང་། མཆོད་པའི་ཆར་ཆེན་པོ་དེ་དག་ཡང་མཐོང་བར་འགྱུར་རོ།
en: The Tathāgata Amitāyus and all the inhabitants of Sukhāvatī will congratulate the vidyā holder, who will hear all their words and will see the clouds of offerings raining down.

source: །གལ་ཏེ་རིག་སྔགས་འཆང་ནམ་མཁའ་ལས་ཆུ་འབེབས་པར་འཚལ་ན། དེའི་ཚེ་བསམས་པ་ཙམ་གྱིས་འབེབས་པར་འགྱུར་རོ།
en: If he wants to descend back to earth, he will descend as soon as he thinks of it.

source: །འོན་ཏེ་མི་འཚལ་ན་ནམ་མཁའ་དེ་ཉིད་ན་ནམ་མཁའ་ལ་གྲུབ་པ་དང་། རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་མཆོག་དོན་ཡོད་རྒྱ་ཆེན་གྲུབ་པ་ཡིད་བཞིན་ནོར་བུ་ལག་པ་ཞེས་བྱ་བའི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །དཔག་ཏུ་མ་མཆིས་པའི་འཁོར་ལོས་སྒྱུར་བའི་རིག་སྔགས་འཆང་གིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: If he does not want to, he can remain there in the sky and become the great emperor of all the siddhas that live throughout the expanse of space, and of the vidyādharas who hold in their hands the great wish-fulfilling jewel that grants the vast amogha accomplishments.

source: །ཚེ་བསྐལ་བ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་གཉིས་སུ་འགྱུར་རོ།
en: He will live there for eight billion great eons and then descend to earth. “

source: །འོན་ཏེ་བབས་ན་ལོ་ཁྲིར་འཚོ་བར་འགྱུར་རོ། །འཇིག་རྟེན་དབང་ཕྱུག་དང་འདྲ་བར་མཆོད་པ་དང་གུས་པ་ཆེན་པོ་བགྱིད་པར་འགྱུར་རོ། །འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་གཙོ་བོ་གཅིག་པུར་འགྱུར་རོ།
en: On earth, he will live ten thousand years and be a unique celebrity throughout the world, receiving offerings and great respect like a lokeśvara.

source: །ལྷ་རྣམས་ཀྱང་བབས་ནས་རིག་སྔགས་འཆང་དེ་ལ་མཆོད་པའི་མཆོག་རྒྱ་ཆེན་པོ་དག་བགྱིད་པར་འགྱུར་རོ།
en: The devas will descend to earth with him and will make bountiful, excellent offerings to him.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་བུ་གཅིག་པ་བཞིན་དུ་མངོན་པར་དགའ་བར་འགྱུར་རོ། །མཆོད་པའི་འོས་སུའང་འགྱུར་རོ།
en: All beings will joyfully welcome him as if he were their only son and will honor him.
